group-reports/shahriar-3-1-tests/resluts/disk-throughput-tuning-protocol-A/test-5.txt
readwrite-randomly-test-job: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
readwrite-randomly-test-job: Laying out IO file (1 file / 10240MiB)

readwrite-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=27043: Thu Jul 13 22:58:13 2023
   read: IOPS=200, BW=1601KiB/s (1639kB/s)(940MiB/601238msec)
    slat (usec): min=3, max=27187, avg=30.50, stdev=79.46
    clat (msec): min=10, max=2719, avg=1275.13, stdev=55.29
     lat (msec): min=10, max=2719, avg=1275.16, stdev=55.29
    clat percentiles (msec):
     |  1.00th=[ 1234],  5.00th=[ 1250], 10.00th=[ 1267], 20.00th=[ 1267],
     | 30.00th=[ 1267], 40.00th=[ 1267], 50.00th=[ 1267], 60.00th=[ 1284],
     | 70.00th=[ 1284], 80.00th=[ 1284], 90.00th=[ 1284], 95.00th=[ 1301],
     | 99.00th=[ 1351], 99.50th=[ 1435], 99.90th=[ 1854], 99.95th=[ 2106],
     | 99.99th=[ 2400]
   bw (  KiB/s): min=   15, max=  624, per=6.28%, avg=100.56, stdev=40.45, samples=19088
   iops        : min=    1, max=   78, avg=12.51, stdev= 5.07, samples=19088
  write: IOPS=86, BW=692KiB/s (709kB/s)(406MiB/601238msec)
    slat (usec): min=5, max=656345, avg=316.54, stdev=9131.54
    clat (usec): min=1314, max=2111.6k, avg=9215.37, stdev=45790.37
     lat (usec): min=1370, max=2111.7k, avg=9532.50, stdev=48162.72
    clat percentiles (usec):
     |  1.00th=[   1893],  5.00th=[   2024], 10.00th=[   2114],
     | 20.00th=[   2245], 30.00th=[   2343], 40.00th=[   2507],
     | 50.00th=[   2606], 60.00th=[   2704], 70.00th=[   2802],
     | 80.00th=[   3097], 90.00th=[   5866], 95.00th=[  16581],
     | 99.00th=[ 219153], 99.50th=[ 329253], 99.90th=[ 591397],
     | 99.95th=[ 675283], 99.99th=[1199571]
   bw (  KiB/s): min=   15, max=  432, per=7.39%, avg=51.16, stdev=33.36, samples=16241
   iops        : min=    1, max=   54, avg= 6.33, stdev= 4.18, samples=16241
  lat (msec)   : 2=1.09%, 4=24.68%, 10=2.35%, 20=0.77%, 50=0.54%
  lat (msec)   : 100=0.26%, 250=0.29%, 500=0.23%, 750=0.08%, 1000=0.09%
  cpu          : usr=0.03%, sys=0.08%, ctx=173316, majf=0, minf=165
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=120287,52010,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1601KiB/s (1639kB/s), 1601KiB/s-1601KiB/s (1639kB/s-1639kB/s), io=940MiB (985MB), run=601238-601238msec
  WRITE: bw=692KiB/s (709kB/s), 692KiB/s-692KiB/s (709kB/s-709kB/s), io=406MiB (426MB), run=601238-601238msec

Disk stats (read/write):
    drbd1: ios=120287/52050, merge=0/0, ticks=153200369/489586, in_queue=153689955, util=99.98%, aggrios=120287/52090, aggrmerge=0/0, aggrticks=153228412/474475, aggrin_queue=153702887, aggrutil=99.98%
    dm-0: ios=120287/52090, merge=0/0, ticks=153228412/474475, in_queue=153702887, util=99.98%, aggrios=120287/52090, aggrmerge=0/0, aggrticks=153230372/475208, aggrin_queue=153619702, aggrutil=99.98%
  vdb: ios=120287/52090, merge=0/0, ticks=153230372/475208, in_queue=153619702, util=99.98%